package com.renrenlab.rlab.common.constant;

/**
 * Created by guanjipeng on 2017/12/5.
 */
public interface SmsConstant {
    //您好，您的验证码为：${code}，有效期10分钟
    String SMS_115750386 = "SMS_115750386";
    //【人人实验】终于等到你，还好我没放弃，人人实验欢迎你。您的默认登录密码为：" + randomPassword + "，请及时修改您的密码。
    String SMS_115920231 = "SMS_115920231";

    //【人人实验】尊敬的用户，您的微需求状态已更新，登录renrenlab.com查看。如有疑问，请拨打4001029559咨询。
    String SMS_115930224 = "SMS_115930224";
    //【人人实验】尊敬的用户，您的微需求于3日后过期，登录renrenlab.com延期。如有疑问，请拨打4001029559咨询。
    String SMS_117517666 = "SMS_117517666";
    //【人人实验】尊敬的用户，您的微需求于3日后过期。若已解决，登录renrenlab.com更新状态。如有疑问，请拨打4001029559咨询
    String SMS_115920203 = "SMS_115920203";

    //【人人实验】贵公司人人创新券项目申请审核未通过，请登录renrenlab.com查看原因，如有疑问可致电4001029559。
    String SMS_116581639 = "SMS_116581639";
    //【人人实验】贵司人人创新券项目申请审核通过，请3日内登录renrenlab.com完成项目申请补充材料，有疑问致电4001029559。
    String SMS_116561644 = "SMS_116561644";
    //【人人实验】尊敬的用户，贵公司人人创新券资格认证审核未通过，请登录renrenlab.com查看原因，如有疑问可致电4001029559。
    String SMS_116580229 = "SMS_116580229";
    //【人人实验】贵司人人创新券资格认证审核通过，请7日内邮寄材料并登录renrenlab.com提交项目申请，如有疑问致电4001029559。
    String SMS_116565209 = "SMS_116565209";


    /**
     * 审核通过or拒绝，短信通知申请人
     * 【人人实验】尊敬的用户，您的微需求状态已更新，登录renrenlab.com查看。如有疑问，请拨打4001029559咨询。
     */
    String REQ_STATE_MODIFY = "【人人实验】尊敬的用户，您的微需求状态已更新，登录renrenlab.com查看。如有疑问，请拨打4001029559咨询。";
    /**
     * 需求还剩3天过期，则上午十点给用户发信息提醒
     * 【人人实验】尊敬的用户您好，您发布的微需求将于3日后过期。若需求已解决，敬请登录人人实验官网www.renrenlab.com更新需求状态；若需求尚未解决，我们建议您登录官网设置延长有效期。如有疑问，欢迎拨打客服热线4001029559咨询。
     */
    String WILLBE_OUT_DATE = "【人人实验】尊敬的用户，您的微需求于3日后过期，登录renrenlab.com延期。如有疑问，请拨打4001029559咨询。";
    /**
     * 需求已延长过一次有效期，还剩3天的时候仍然发短信给用户
     * 【人人实验】尊敬的用户您好，您发布的微需求将于3日后过期。若需求已解决，敬请登录人人实验官网www.renrenlab.com更新需求状态。如有疑问，欢迎拨打客服热线4001029559咨询。
     */
    String WILLBE_OUT_DATE2 = "【人人实验】尊敬的用户，您的微需求于3日后过期。若已解决，登录renrenlab.com更新状态。如有疑问，请拨打4001029559咨询";


    String COUPON_PASS = "【人人实验】贵司人人创新券资格认证审核通过，请7日内邮寄材料并登录renrenlab.com提交项目申请，如有疑问致电4001029559。";
    String COUPON_NOT_PASS = "【人人实验】尊敬的用户，贵公司人人创新券资格认证审核未通过，请登录renrenlab.com查看原因，如有疑问可致电4001029559。";
    String PROJECT_PASS = "【人人实验】贵司人人创新券项目申请审核通过，请3日内登录renrenlab.com完成项目申请补充材料，有疑问致电4001029559。";
    String PROJECT_NOT_PASS = "【人人实验】贵公司人人创新券项目申请审核未通过，请登录renrenlab.com查看原因，如有疑问可致电4001029559。";




    String DEFAULT_PASSWORD_PREFIX = "【人人实验】终于等到你，还好我没放弃，人人实验欢迎你。您的默认登录密码为：";
    String DEFAULT_PASSWORD_SUFFIX = "，请及时修改您的密码。";

    String VREIFYCODE_PREFIX = "您好，您的验证码为：";
    String VREIFYCODE_SUFFIX = "，有效期10分钟【人人实验】";

}
